Project/Toir.Adaptation/src/Documents/гкс_УстановкаСоответствийДолжностейИКвалификаций/гкс_УстановкаСоответствийДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="6c97e420-95e4-408e-a566-e7ccc68f480e">
  <name>гкс_УстановкаСоответствийДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="557516a2-3182-4127-a360-581e4fcfad13">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="334a845e-a148-4216-be8a-910b135a351b">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="20cfd757-f794-4769-8d79-afff4753efa8">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9244cedb-ef22-4f63-bea6-114804f94c1d">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="84c97917-5fa8-470c-ba02-17fcb0a7bcdf">
    <name>Квалификации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c6da1565-eba1-4d40-8e31-0912abafb6c8">
      <name>Должность</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c22d0388-a499-4050-ad2c-3097e6db0b81">
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/InformationRegisters/гкс_СоответствияДолжностейИКвалификаций/гкс_СоответствияДолжностейИКвалификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="72c7b58c-2134-4ea4-a093-6a7b6bde4dde">
  <name>гкс_СоответствияДолжностейИКвалификаций</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="6245ad7c-d63f-4ba1-b08b-cfea682f5233">
    <name>Квалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="05b9fd1c-2f5a-4c5b-aacc-99a73f0ea883">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="4bcbb889-225d-4201-a516-de6ba512a5f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="61c5c699-fd38-4321-ab3d-405fc46cd6b9">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Documents/гкс_УстановкаСоответствийДолжностейИКвалификаций/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьДокумент(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена организация", , "Объект.Организация");
		Возврат;
	КонецЕсли; 
	Если Не ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнено подразделение", , "Объект.Подразделение");
		Возврат;
	КонецЕсли; 
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьТЧДокумента", ЭтотОбъект), 
					НСтр("es='Se borrará la sección tabular. ¿Continuar la operación?';"
							"ru='Табличная часть будет очищена. Продолжить операцию?';"
							"en='The tabular section will be cleared. Continue the operation?'"), 
					РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьТЧДокумента(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Квалификации.Очистить();
		ЗаполнитьТЧДокументаНаСервере()
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧДокументаНаСервере()
	
	ДанныеСоответствияКвалификацийИДолжностей 
		= РегистрыСведений.гкс_СоответствияДолжностейИКвалификаций.ПолучитьДанныеРегистра(Объект.Организация,
																						  Объект.Подразделение,
																						  , 
																						  Объект.Дата);
	Объект.Квалификации.Загрузить(ДанныеСоответствияКвалификацийИДолжностей);
	
КонецПроцедуры

#КонецОбласти
